# Regression in Scikit-learn

In [33]:
# importing libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt


#other
from sklearn.model_selection import train_test_split  # jab ji machine learning ka module pa work karna ha ya train_test_split lazmi karna ha takay data ko split kyea ja sakay
from sklearn.linear_model import LinearRegression

In [34]:
df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [35]:
# simple Linear Regression
x=df[['age']] # this is double dimensional data
y=df['fare']

In [36]:
x.isnull().sum() /len(x) *100
# y.isnull().sum() /len(y) *100   # in y no null values

age    19.86532
dtype: float64

In [37]:
# age column fill with mean
df['age'] = x['age'].fillna(x['age'].mean(), inplace=True)

C:\Users\Abdul-Samad\AppData\Local\Temp\ipykernel_9812\185084265.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'] = x['age'].fillna(x['age'].mean(), inplace=True)
C:\Users\Abdul-Samad\AppData\Local\Temp\ipykernel_9812\185084265.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['age'] = x['age'].fillna(x['age'].mean(), inplace=True)

In [38]:
x.isnull().sum()/len(x) *100

age    0.0
dtype: float64

In [39]:
x

           age
0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
..         ...
886  27.000000
887  19.000000
888  29.699118
889  26.000000
890  32.000000

[891 rows x 1 columns]

In [40]:
x.shape

(891, 1)

In [41]:
y.shape

(891,)